<?php
/*==================================================================================================
--------------------------------
Модуль	: Ядро платформы
Описание: Работа с JSON
Версия	: 1.0.0/ALPHA
Дата	: 2012-05-11
Автор	: Станислав В. Третьяков
--------------------------------
==================================================================================================*/



trait Core_Trait_JSON{


	/*==============================================================================================
	Функции JSON
	==============================================================================================*/


	#--------------------------------------------------
	# Преобразование переменной в JSON
	#--------------------------------------------------

	public static function jsonEncode($mixed){
		return json_encode($mixed);
	}#end function




#--------------------------------------------------
# Функция преобразует ассоциированный массив в объект JSON
#--------------------------------------------------
/*
 * Входные параметры:
 * $arr(*) - ассоциированный массив полей, которые нужно преобразовать
 * $white - массив полей по белому списку, только их значения учавствуют в результате
 *          черный список имеет приоритет над белым (если в черном и белом списках есть поле "hash", оно не будет учтено в результирующей строке)
 * $black - массив полей по черному списку
 * $default - значение по умолчанию, возвращаемое, если $arr не задан, не массив или пустой массив
 * 
 * Функция возвращает строку объекта JSON
*/
	public static function jsonFromArray($arr, $white=null, $black=null, $default='{}') {

		if(empty($arr)||!is_array($arr)) return $default;
		$use_white = (!empty($white)&&is_array($white));
		$use_black = (!empty($black)&&is_array($black));

		$result = array();

		foreach($arr as $k=>$v) {

			if ($use_black && in_array($k, $black)) continue;
			if ($use_white && !in_array($k, $white)) continue;

			$result[$k] = is_array($v) ? t($v, $white, $black) : $v;

		}

		return json_encode($result);
	}#end function























































}#end class



?>